vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA133_DFP.pdsc
    <condition id="allOf.component.mem_manager, device=MCXA133.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="component.messaging.condition_id">
      <require condition="allOf.component.lists, component.mem_manager, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, component.mem_manager, device=MCXA133.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=MCXA133.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="component.ostimer_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MCXA133.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXA133.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXA133.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXA133.internal_condition">
      <require condition="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition">
      <accept condition="allOf.component.lpspi_adapter, driver.lpspi.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpspi_adapter, driver.lpspi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXA133.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device=MCXA133.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXA133.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXA133.internal_condition">
      <require condition="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer.internal_condition">
      <accept condition="allOf.component.ctimer_adapter, driver.ctimer.internal_condition"/>
      <accept condition="allOf.component.lptmr_adapter, driver.lptmr.internal_condition"/>
      <accept condition="allOf.component.ostimer_adapter, driver.ostimer.internal_condition"/>
    </condition>
    <condition id="allOf.component.ctimer_adapter, driver.ctimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
    </condition>
    <condition id="allOf.component.lptmr_adapter, driver.lptmr.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="allOf.component.ostimer_adapter, driver.ostimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXA133.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXA133.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXA133.internal_condition"/>
    </condition>
    <condition id="device_id.MCXA133.internal_condition">
      <accept Dname="MCXA133VFM" Dvendor="NXP:11"/>
      <accept Dname="MCXA133VFT" Dvendor="NXP:11"/>
      <accept Dname="MCXA133VLF" Dvendor="NXP:11"/>
    </condition>
