vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA133_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lpcac" Cversion="2.2.0" condition="driver.cache_lpcac_n4a_mcxn.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_cache_lpcac.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA133/drivers/fsl_cache_lpcac.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cdog" Cversion="2.1.3" condition="driver.cdog.condition_id">
      <description>cdog Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/drivers/fsl_cdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_cdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.0.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA133/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="GPIO" Csub="gpio_cmsis" Cversion="1.0.0" Capiversion="1.0.0" condition="driver.cmsis_gpio.condition_id">
      <description>GPIO CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/cmsis_drivers/fsl_gpio_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/cmsis_drivers/fsl_gpio_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="sourceC" name="devices/MCXA133/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="header" name="devices/MCXA133/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA133/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.3.3" condition="driver.ctimer.condition_id">
      <description>CTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/drivers/fsl_ctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_ctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.10.6" condition="driver.edma4.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXA133/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXA133/drivers/fsl_edma_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA133/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA133/drivers/"/>
      </files>
    </component>
